package Seminar05;

public class HWTask03 {
   public static void main(String[] args) {
      System.out.println("Hi !");
   }
}

/*
 * Написать метод, который переведет число из римского формата записи в
 * арабский. Например, MMXXII = 2022 (правила см. во вложениях к уроку, где
 * ссылка на репозиторий).
 */