public class LecHWTask02 {
   public static void main(String[] args) {
      /*
       * Даны два файла, в каждом из которых находится запись многочлена.
       * Сформировать файл, содержащий сумму многочленов.
       */
      System.out.println("Hi !");
   }
}
