public class HWTask02 {
   public static void main(String[] args) {
      // Реализуйте алгоритм сортировки пузырьком числового массива, результат после
      // каждой итерации запишите в лог-файл.
      System.out.println("Hi !");
   }
}
